export const mdContentOne = `
## لماذا نتعلم HTML ؟

HTML هي أساس كل لغات تطوير الويب، وبدونها لن نكون قادرين على التعامل مع النصوص والصور والفيديوهات على صفحات الويب. تعتبر HTML لغة وصفية لأنها تصف مكونات صفحات الويب عن طريق الوسوم Tags، وهي بداية كل شي تحتاج لتعلمه لتستطيع برمجة صفحات ويب جذابة.


## ماهي الوسوم Tags ؟

الوسوم Tags هي مجموعة من العناصر يتم استخدامها لعرض محتوى الصفحة والتأثير عليه.


## الهيكل العام لصفحات الويب

هكذا يبدو الهيكل العام لأي صفحة ويب على شبكة الانترنت.

\`\`\`html
<DOCTYPE html!>
<html>

<head>
<title/>عنوان الصفحة<title>
<head/>

<body>
<p/>أهلا وسهلا<p>
<body/>

<html/>
\`\`\`
    
- يقوم الوسم <DOCTYPE html!> بتعريف نوع الصفحة ليسهل على المتصفح عرض صفحات HTML عرضا صحيحا.
- <html> </html> هو الوسم الرئيسي في كل صفحة ويب ويحتوي على جميع الوسوم Tags بداخله، بين بداية الوسم <html> ونهاية الوسم <html/>.
- الوسم <head> </head> يحتوي على معلومات وتعاريف الصفحة كما يحتوي بداخله على الوسم <title> </title> والذي يمثل عنوان الصفحة الذي يتم عرضه في المتصفح.
- الوسم <title> </title> يجب أن يكون مُضمّنا داخل وسم <head> </head>
- الوسم <body> </body> يحتوي على كل العناصر المعروضة في الصفحة، ويجب إضافة كل الوسوم التي نرغب بعرضها في صفحة الويب داخل الوسم  كما فعلنا مع الوسم <p></p>
`;

export const mdContentTwo = `
## ماهي العناوين في لفة HTML ؟

العناوين يتم تعريفها عن طريق استخدام وسم <h1> الى وسم <h6>


-  الوسم  <h1> هو أكبر مقاس للعناوين ويحددالعنوان الأكثر أهمية

- ووسم <h6>  هو أصغر مقاس للعناوين ويحدد العنوان الاقل أهمية



### هكذا تبدو العناوين:.


\`\`\`html

<h1>العنوان 1</h1>

<h2>العنوان 2</h2>

<h3>العنوان 3</h3>

<h4>العنوان 4</h4>

<h5>العنوان 5</h5>

<h6>العنوان 6</h6>

\`\`\`
 
## ماهي أهمية العناوين:

- محركات البحث  (مثل محرك بحث جوجل )  تستخدم العناوين لفهرسة البنية الاساسية ومحتوى الصفحات الويب.

- يعمل المستخدمون على التنقل بين صفحات الويب حسب عناوينها لذا لا بد من استخدام العناوين لعرض بنية المستند.

- يجب استخدام وسم <h1> للعناوين الرئيسية ، متبوعة بعناوين <h2> ،ثم الاقل اهمية <h3> وهكذا .
`;

export const mdContentThree = `
## كيف يمكننا إدراج الصور في لفة HTML ؟

هذا سهل جدا يمكنك تحديد كيفية عرض الصور عن طريق الوسم: <img /> لكن الوسم الكامل يكون على الشكل التالي:

\`\`\`html

<img src="رابط الصورة"/>

\`\`\`



- src: لعرض الصورة داخل صفحتك يجب عليك إستخدام سمة المصدر src حيث انها اختصار ل "source"


- width : للتحكم في عرض الصورة


- height :  للتحكم في طول الصورة


- alt : وذلك لكتابة اي نص يمكن ان يظهر مكان الصورة في حالة لم تظهر الصوره.


\`\`\`html

<img src="tarek.jpg" width="100" height="100" alt="القرصان البطل"/>

\`\`\`

## كيفية عرض الصور?


المتصفح يقوم بعرض الصورة في المكان الموجود به وسم الصورة في ملف HTML ، فإذا قمت بوضع وسم الصورة بين فقرتين ، فإن المتصفح يعرض الفقرة الأولي ثم الصورة ثم الفقرة الثانية ... و بالمثل إذا قمت بوضع الصورة داخل خلية جدول سوف يقوم المتصفح بعرض الصورة وفقاً لمكان الخلية في الجدول .

`;
